bench/profiles/bounded/baseline/native-mars-time-4.wrk.txt
Running 5s test @ http://127.0.0.1:55507/api/users/123
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   492.47us  111.49us   5.47ms   97.38%
    Req/Sec    32.21k     1.15k   33.94k    73.04%
  Latency Distribution
     50%  479.00us
     75%  506.00us
     90%  538.00us
     99%  669.00us
  653659 requests in 5.10s, 62.96MB read
Requests/sec: 128165.32
Transfer/sec:     12.35MB