bench/profiles/bounded/baseline/native-mars-time-5.wrk.txt
Running 5s test @ http://127.0.0.1:55661/api/users/123
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   512.86us  169.32us   7.55ms   97.36%
    Req/Sec    31.13k     2.05k   33.23k    87.25%
  Latency Distribution
     50%  491.00us
     75%  520.00us
     90%  563.00us
     99%    0.92ms
  631971 requests in 5.10s, 60.87MB read
Requests/sec: 123883.50
Transfer/sec:     11.93MB